app/Controllers/Admin/UsuarioController.php

    public function index()
    {
        $usuarios = $this->usuario->orderBy('id', 'desc')->findAll(50);
---
SELECT *
FROM `usuarios`
ORDER BY `id` DESC
 LIMIT 50