app/Controllers/EncuestaController.php

    public function index()
    {
        $encuestaModel = new EncuestaModel();
        $data['encuestas'] = $encuestaModel->findAll();
---
SELECT *
FROM `encuestas`

    public function store()
    {
        $encuestaModel = new \App\Models\EncuestaModel();
        $data = $this->request->getPost();
        $encuestaModel->insert($data);
---
INSERT INTO `encuestas` (`titulo`, `descripcion`, `created_at`, `updated_at`) VALUES ('asdasd', 'asdasdasdas', '2023-10-21 01:20:37', '2023-10-21 01:20:37')

    public function edit($id)
    {
        $encuestaModel = new \App\Models\EncuestaModel();
        $data['encuesta'] = $encuestaModel->find($id);
---
SELECT *
FROM `encuestas`
WHERE `encuestas`.`id` = '1'

    public function delete($id)
    {
        $encuestaModel = new \App\Models\EncuestaModel();
        $encuestaModel->delete($id);
---
DELETE FROM `encuestas`
WHERE `id` IN ('1')

    public function preguntas($encuestaId)
    {
        // Carga el modelo de preguntas
        $preguntaModel = new \App\Models\PreguntaModel();

        // Obtén las preguntas relacionadas con la encuesta específica
        $preguntas = $preguntaModel->where('encuesta_id', $encuestaId)->findAll();

        // Obtén información de la encuesta
        $encuestaModel = new \App\Models\EncuestaModel();
        $encuesta = $encuestaModel->find($encuestaId);
---
SELECT *
FROM `preguntas`
WHERE `encuesta_id` = '1'
SELECT *
FROM `encuestas`
WHERE `encuestas`.`id` = '1'

    public function aplicarEncuesta($encuestaId)
    {
        // Obtener la encuesta
        $encuestaModel = new \App\Models\EncuestaModel();
        $encuesta = $encuestaModel->find($encuestaId);

        if (!$encuesta) {
            return redirect()->to('/encuesta')->with('error', 'La encuesta no existe.');
        }

        // Obtener las preguntas asociadas a la encuesta
        $preguntaModel = new \App\Models\PreguntaModel();
        $preguntas = $preguntaModel->where('encuesta_id', $encuestaId)->findAll();
---
SELECT *
FROM `encuestas`
WHERE `encuestas`.`id` = '1'
SELECT *
FROM `preguntas`
WHERE `encuesta_id` = '1'

    public function guardarRespuestas($encuestaId)
    {
        // Obtener datos del formulario
        $encuestadoNombre = $this->request->getPost('encuestado_nombre');
        $respuestas = $this->request->getPost('respuesta');

        // Verificar si la encuesta existe
        $encuestaModel = new \App\Models\EncuestaModel();
        $encuesta = $encuestaModel->find($encuestaId);

        if (!$encuesta) {
            return redirect()->to('/encuesta')->with('error', 'La encuesta no existe.');
        }

        // Crear un modelo para las respuestas
        $respuestaModel = new \App\Models\RespuestaModel();

        // Guardar las respuestas en la base de datos
        foreach ($respuestas as $preguntaId => $respuesta) {
            $data = [
                'encuesta_id' => $encuestaId,
                'pregunta_id' => $preguntaId,
                'encuestado_nombre' => $encuestadoNombre,
                'respuesta' => $respuesta,
            ];

            $respuestaModel->insert($data);
---
SELECT *
FROM `encuestas`
WHERE `encuestas`.`id` = '1'
INSERT INTO `respuestas` (`encuesta_id`, `pregunta_id`, `encuestado_nombre`, `respuesta`, `created_at`, `updated_at`) VALUES ('1', 2, 'Edgar', '3', '2023-10-19 00:29:54', '2023-10-19 00:29:54')