app/Controllers/PreguntaController.php

    public function store()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'encuesta_id' => 'required|numeric',
            'pregunta' => 'required',
            'tipo' => 'required',
            // Agrega las reglas de validación necesarias para otros campos
        ]);

        if ($validation->withRequest($this->request)->run()) {
            $preguntaModel = new \App\Models\PreguntaModel();
            $data = [
                'encuesta_id' => $this->request->getPost('encuesta_id'),
                'pregunta' => $this->request->getPost('pregunta'),
                'tipo' => $this->request->getPost('tipo'),
                // Agrega otros campos de pregunta según tu base de datos
            ];
            $preguntaModel->insert($data);
---
INSERT INTO `preguntas` (`encuesta_id`, `pregunta`, `created_at`, `updated_at`) VALUES ('1', 'pregunta 2', '2023-10-19 00:25:51', '2023-10-19 00:25:51')

    public function edit($preguntaId)
    {
        // Recupera la pregunta de la base de datos utilizando el ID
        $preguntaModel = new \App\Models\PreguntaModel();
        $pregunta = $preguntaModel->find($preguntaId);
---
SELECT *
FROM `preguntas`
WHERE `preguntas`.`id` = '3'

    public function agregarOpciones($preguntaId)
    {
        // Verifica si la pregunta existe
        $preguntaModel = new \App\Models\PreguntaModel();
        $pregunta = $preguntaModel->find($preguntaId);
---
SELECT *
FROM `preguntas`
WHERE `preguntas`.`id` = '2'

    public function guardarOpciones()
    {
        $preguntaId = $this->request->getPost('pregunta_id');
        $opciones = $this->request->getPost('opciones');

        // Verifica si la pregunta existe
        $preguntaModel = new \App\Models\PreguntaModel();
        $pregunta = $preguntaModel->find($preguntaId);
---
SELECT *
FROM `preguntas`
WHERE `preguntas`.`id` = '2'

    public function ver($preguntaId)
    {
        $preguntaModel = new \App\Models\PreguntaModel();
        $pregunta = $preguntaModel->find($preguntaId);
---
SELECT *
FROM `preguntas`
WHERE `preguntas`.`id` = '2'